# Data Cleaning and Preparation

During the course of doing data analysis and modeling, a significant  amount of time is spent on data preparation: loading, cleaning,  transforming, and rearranging. Such tasks are often reported to take up 80%  or more of an analystâ€™s time. Sometimes the way that data is stored in files  or databases is not in the right format for a particular task. Many  researchers choose to do ad hoc processing of data from one form to another  using a general-purpose programming language, like Python, Perl, R, or Java,  or Unix text-processing tools like sed or awk. Fortunately, pandas, along  with the built-in Python language features, provides you with a high-level,  flexible, and fast set of tools to enable you to manipulate data into the  right form.

## Handling Missing Data

Missing data occurs commonly in many data analysis applications. One of the goals of pandas is to make working with missing data as painless as possible. For example, all of the descriptive statistics on pandas objects exclude missing data by default.

In [1]:
import pandas as pd
import numpy as np

string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [2]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

The built-in Python None value is also treated as NA in object arrays:

In [3]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

## Filtering Out Missing Data

In [4]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])

data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [5]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [7]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [8]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [9]:
data[4] = NA
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -1.081189       NaN       NaN
1 -0.307302       NaN       NaN
2  0.400270       NaN  0.253729
3  1.889190       NaN -0.578691
4  0.812737 -0.303509 -0.018077
5  0.526198 -0.703840  0.936113
6  0.584939  0.456930  0.563567

In [11]:
df.dropna()

          0         1         2
4  0.812737 -0.303509 -0.018077
5  0.526198 -0.703840  0.936113
6  0.584939  0.456930  0.563567

In [12]:
df.dropna(thresh=2)

          0         1         2
2  0.400270       NaN  0.253729
3  1.889190       NaN -0.578691
4  0.812737 -0.303509 -0.018077
5  0.526198 -0.703840  0.936113
6  0.584939  0.456930  0.563567

## Filling In Missing Data

In [13]:
df.fillna(0)

          0         1         2
0 -1.081189  0.000000  0.000000
1 -0.307302  0.000000  0.000000
2  0.400270  0.000000  0.253729
3  1.889190  0.000000 -0.578691
4  0.812737 -0.303509 -0.018077
5  0.526198 -0.703840  0.936113
6  0.584939  0.456930  0.563567

In [14]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -1.081189  0.500000  0.000000
1 -0.307302  0.500000  0.000000
2  0.400270  0.500000  0.253729
3  1.889190  0.500000 -0.578691
4  0.812737 -0.303509 -0.018077
5  0.526198 -0.703840  0.936113
6  0.584939  0.456930  0.563567

In [15]:
df.fillna(0, inplace=True)

In [16]:
df

          0         1         2
0 -1.081189  0.000000  0.000000
1 -0.307302  0.000000  0.000000
2  0.400270  0.000000  0.253729
3  1.889190  0.000000 -0.578691
4  0.812737 -0.303509 -0.018077
5  0.526198 -0.703840  0.936113
6  0.584939  0.456930  0.563567

In [17]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA

In [18]:
df.fillna(method='ffill')

          0         1         2
0  0.741637 -0.856287 -1.384020
1  0.986468  1.964561 -0.070481
2  0.457389  1.964561 -0.459753
3  1.153635  1.964561 -0.298057
4 -2.358301  1.964561 -0.298057
5 -0.218202  1.964561 -0.298057

In [19]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.741637 -0.856287 -1.384020
1  0.986468  1.964561 -0.070481
2  0.457389  1.964561 -0.459753
3  1.153635  1.964561 -0.298057
4 -2.358301       NaN -0.298057
5 -0.218202       NaN -0.298057

In [20]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Data Transformation

In [21]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [22]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [23]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [25]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [26]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [27]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## Transforming Data Using a Function or Mapping

In [28]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [30]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [31]:
lowercased = data['food'].str.lower()
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [32]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## Replacing Values

In [33]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [34]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [35]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [36]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [37]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## Renaming Axis Indexes

In [39]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'],columns=['one', 'two', 'three', 'four'])
transform = lambda x: x[:4].upper()
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [40]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [41]:
data.rename(index={'OHIO': 'INDIANA'},columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

## Discretization and Binning

In [42]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [43]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [44]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [45]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [46]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [47]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.5, 0.75], (0.0068, 0.26], (0.75, 1.0], (0.26, 0.5], (0.26, 0.5], ..., (0.75, 1.0], (0.5, 0.75], (0.0068, 0.26], (0.0068, 0.26], (0.5, 0.75]]
Length: 20
Categories (4, interval[float64]): [(0.0068, 0.26] < (0.26, 0.5] < (0.5, 0.75] < (0.75, 1.0]]

In [48]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4)
cats

[(-3.3859999999999997, -0.655], (-0.655, 0.0734], (-0.655, 0.0734], (-0.655, 0.0734], (-0.655, 0.0734], ..., (-0.655, 0.0734], (0.677, 3.393], (0.0734, 0.677], (0.0734, 0.677], (0.677, 3.393]]
Length: 1000
Categories (4, interval[float64]): [(-3.3859999999999997, -0.655] < (-0.655, 0.0734] < (0.0734, 0.677] < (0.677, 3.393]]

In [49]:
pd.value_counts(cats)

(0.677, 3.393]                   250
(0.0734, 0.677]                  250
(-0.655, 0.0734]                 250
(-3.3859999999999997, -0.655]    250
dtype: int64

## Detecting and Filtering Outliers

In [50]:
data = pd.DataFrame(np.random.randn(1000, 4))
col = data[2]
col

0     -1.199950
1     -1.369341
2      0.399757
3      0.290627
4     -0.360809
         ...
995   -1.009355
996   -1.705267
997    0.779259
998   -1.780682
999    1.049598
Name: 2, Length: 1000, dtype: float64

In [51]:
col[np.abs(col) > 3]

46    3.556131
Name: 2, dtype: float64

In [58]:
data[(np.abs(data) > 3)] = np.sign(data) * 3

In [59]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.031429    -0.005432    -0.061052    -0.051598
std       0.994885     1.011363     0.975831     0.995397
min      -3.000000    -3.000000    -2.753712    -3.000000
25%      -0.630046    -0.645882    -0.709126    -0.718719
50%      -0.008846    -0.041473    -0.033610    -0.067796
75%       0.689376     0.705050     0.578439     0.601948
max       3.000000     3.000000     3.000000     2.952696

<mark>The statement np.sign(data) produces 1 and â€“1 values based on whether the values in data are positive or negative</mark>

<hr/>